// src/data/news.js
export const newsList = [
  {
    id: 1,
    title: "ข่าวประชาสัมพันธ์: เปิดรับสมัครสหกิจศึกษา ภาคเรียนที่ 1/2568",
    date: "2025-01-01",
    description:
      "คณะวิทยาศาสตร์ มหาวิทยาลัยศิลปากร เปิดรับสมัครนักศึกษาที่สนใจเข้าร่วมโครงการสหกิจศึกษา ภาคเรียนที่ 1/2568 โดยนักศึกษาสามารถดูรายละเอียดการรับสมัคร คุณสมบัติ เอกสารที่ต้องเตรียม และกำหนดการได้ทางเว็บไซต์ของคณะ ตั้งแต่วันที่ 1 มกราคม 2568 เป็นต้นไป",
    category: "ประชาสัมพันธ์",
    images: [
      "https://i.pinimg.com/736x/c9/a8/bb/c9a8bbf40e4ea04310ff4cc2b94e9f95.jpg",
    ],
  },
  {
    id: 2,
    title: "กิจกรรม: การปฐมนิเทศนักศึกษาสหกิจศึกษา ปี 2568",
    date: "2025-02-10",
    description:
      "คณะวิทยาศาสตร์จัดกิจกรรมปฐมนิเทศนักศึกษาสหกิจศึกษาเพื่อให้คำแนะนำขั้นตอนการปฏิบัติงาน ข้อควรระวัง และสิทธิประโยชน์ที่จะได้รับ โดยมีวิทยากรผู้ทรงคุณวุฒิให้ความรู้และตอบข้อสงสัย พร้อมกิจกรรมแลกเปลี่ยนประสบการณ์จากรุ่นพี่",
    category: "กิจกรรม",
    images: [
      "https://i.pinimg.com/736x/c9/a8/bb/c9a8bbf40e4ea04310ff4cc2b94e9f95.jpg",
      "https://i.pinimg.com/736x/c9/a8/bb/c9a8bbf40e4ea04310ff4cc2b94e9f95.jpg",
      "https://i.pinimg.com/736x/c9/a8/bb/c9a8bbf40e4ea04310ff4cc2b94e9f95.jpg",
      "https://i.pinimg.com/736x/c9/a8/bb/c9a8bbf40e4ea04310ff4cc2b94e9f95.jpg",
      "https://i.pinimg.com/736x/c9/a8/bb/c9a8bbf40e4ea04310ff4cc2b94e9f95.jpg",
    ],
  },
  {
    id: 3,
    title: "ประกาศผล: รายชื่อนักศึกษาที่ผ่านการคัดเลือกสหกิจศึกษา",
    date: "2025-03-15",
    description:
      "ประกาศผลรายชื่อนักศึกษาที่ผ่านการคัดเลือกเข้าร่วมโครงการสหกิจศึกษาประจำปีการศึกษา 2568 โดยนักศึกษาที่มีรายชื่อสามารถเข้าระบบออนไลน์เพื่อดูรายละเอียดการส่งเอกสารและขั้นตอนต่อไป",
    category: "ประกาศผลการคัดเลือก",
    images: [],
  },
  {
    id: 4,
    title: "ข่าวด่วน: เปลี่ยนแปลงกำหนดการส่งเอกสารโครงการสหกิจศึกษา",
    date: "2025-04-01",
    description:
      "แจ้งเปลี่ยนแปลงกำหนดการส่งเอกสารสำหรับนักศึกษาที่เข้าร่วมโครงการสหกิจศึกษา จากเดิมวันที่ 5 เมษายน 2568 เป็นวันที่ 10 เมษายน 2568 เพื่อความสะดวกของนักศึกษา",
    category: "ข่าวด่วน",
    images: [
      "https://i.pinimg.com/736x/c9/a8/bb/c9a8bbf40e4ea04310ff4cc2b94e9f95.jpg",
      "https://i.pinimg.com/736x/c9/a8/bb/c9a8bbf40e4ea04310ff4cc2b94e9f95.jpg",
    ],
  },
  {
    id: 5,
    title: "ข่าวประชาสัมพันธ์: เปิดรับสมัครสหกิจศึกษา ภาคเรียนที่ 1/2568",
    date: "2025-01-01",
    description:
      "คณะวิทยาศาสตร์ มหาวิทยาลัยศิลปากร เปิดรับสมัครนักศึกษาที่สนใจเข้าร่วมโครงการสหกิจศึกษา ภาคเรียนที่ 1/2568 โดยนักศึกษาสามารถดูรายละเอียดการรับสมัคร คุณสมบัติ เอกสารที่ต้องเตรียม และกำหนดการได้ทางเว็บไซต์ของคณะ ตั้งแต่วันที่ 1 มกราคม 2568 เป็นต้นไป",
    category: "ประชาสัมพันธ์",
    images: [
      "https://i.pinimg.com/736x/c9/a8/bb/c9a8bbf40e4ea04310ff4cc2b94e9f95.jpg",
      "https://i.pinimg.com/736x/c9/a8/bb/c9a8bbf40e4ea04310ff4cc2b94e9f95.jpg",
      "https://i.pinimg.com/736x/c9/a8/bb/c9a8bbf40e4ea04310ff4cc2b94e9f95.jpg",
    ],
  }
];

export default newsList